## Database Exercise

In this exercise, we are implementing a simply banking information system. We are using two relations Customer and Withdraw. The schemas are:

- *Customer ( cust_id,name )* (*cust_id* is the primary key)
- *Withdraw ( w_id, cust_id, acc_id,date, amount )* (*w_id* is the primary key)

The SQL for creating the two tables are:
- ``CREATE TABLE Customer (cust_id VARCHAR(20) PRIMARY KEY, name VARCHAR(20))``
- ``CREATE TABLE Withdraw (w_id INTEGER PRIMARY KEY, cust_id INTEGER, acc_id VARCHAR(20), date DATE, ammount INTEGER)``

Write programs to solve all the questions. Noted that:
- Use any database you want. (MySQL, SQLite or any).
- Also, you can use any DB-API or SQLAlchemy.
- You can add more functions, as needed.

### Question 1

Write program to create the two tables and insert tuples into the tables. The tables should looks like as follows:

                                                        Customer

|cust_id|name|
|-----|-----|
|101|Anna|
|102|Bob|
|103|Charles|
|104|Damon|
|105|Elena|

                                                         Withdraw
                                                         
|w_id|cust_id|acc_id|date|amount|
|---|---|---|---|---|
|1|101|A01|2019-03-01|100|
|2|102|A01|2019-03-02|200|
|3|102|A02|2019-03-03|150|
|4|103|A03|2019-03-04|180|
|5|104|A04|2019-03-05|500|
|6|105|A05|2019-03-06|300|

In [1]:
def create_tables():
    import mysql.connector
    connection = mysql.connector.connect (host = "172.16.199.130",
                              user = "mengrui",  
                              passwd = "UICdsmengrui",
                                     db = "mengrui")

    cursor = connection.cursor()
    sql_drop_c = "DROP TABLE if exists Customer"
    sql_drop_w = "DROP TABLE if exists Withdraw"
    cursor.execute(sql_drop_c)
    cursor.execute(sql_drop_w)
    sql1 = "CREATE TABLE Customer (cust_id VARCHAR(20) PRIMARY KEY, name VARCHAR(20))";
    sql2 = "CREATE TABLE Withdraw (w_id INTEGER PRIMARY KEY, cust_id INTEGER, acc_id VARCHAR(20), date DATE, ammount INTEGER)";
    
    cursor.execute (sql1)
    cursor.execute (sql2)
    data_cust = [('101','Anna'),('102','Bob'),('103','Charles'),('104','Damon'),('105','Elena')]
    data_withdraw=[(1,'101','A01','2019-03-01',100),(2,'102','A01','2019-03-02',200),(3,'102','A02','2019-03-03',150),
                   (4,'103','A03','2019-03-04',180),(5,'104','A04','2019-03-05',500),(6,'105','A05','2019-03-06',300)]
    for c in data_cust:
        sql_command = "INSERT INTO Customer values('{0}','{1}')".format(c[0],c[1])
        cursor.execute(sql_command)
    for w in data_withdraw:
        sql_command = "INSERT INTO Withdraw values({0},'{1}','{2}','{3}','{4}')".format(w[0],w[1],w[2],w[3],w[4])
        cursor.execute(sql_command)
    connection.commit()
    cursor.close()
    connection.close()

In [2]:
create_tables()

### Question 2

Read all the information in table *Customer* and *Withdraw*, return the two tables as two DataFrames.

In [3]:
def read_table():
    data_cust = []
    data_withdraw = []
    header_cust=['cust_id','name']
    header_withdraw=['w_id','cust_id','acc_id','date','amount']
    import mysql.connector
    import pandas as pd
    connection = mysql.connector.connect (host = "172.16.199.130",
                              user = "mengrui",  
                              passwd = "UICdsmengrui",
                                     db = "mengrui")

    cursor = connection.cursor()
    cmd_customer = "SELECT * FROM Customer"
    cmd_withdraw = "SELECT * FROM Withdraw"
    cursor.execute(cmd_customer)
    result = cursor.fetchall() 
    for r in result:
        data_cust.append({header_cust[i]:r[i] for i in range(len(r))})
    
    cursor.execute(cmd_withdraw)
    result = cursor.fetchall()
    for r in result:
        data_withdraw.append({header_withdraw[i]:r[i] for i in range(len(r))})
    
    cursor.close();
    connection.close();
    return pd.DataFrame(data_cust),pd.DataFrame(data_withdraw)

In [4]:
cust,withd=read_table()
cust

  cust_id     name
0     101     Anna
1     102      Bob
2     103  Charles
3     104    Damon
4     105    Elena

In [5]:
withd

  acc_id  amount  cust_id        date  w_id
0    A01     100      101  2019-03-01     1
1    A01     200      102  2019-03-02     2
2    A02     150      102  2019-03-03     3
3    A03     180      103  2019-03-04     4
4    A04     500      104  2019-03-05     5
5    A05     300      105  2019-03-06     6

### Question 3

Write a program to retrieve the ``cust-id`` of the customer who withdraw the largest number of times.

In [6]:
def largetime_cust():
    import mysql.connector
    import pandas as pd
    connection = mysql.connector.connect (host = "172.16.199.130",
                              user = "mengrui",  
                              passwd = "UICdsmengrui",
                                     db = "mengrui")

    cursor = connection.cursor()
    sql = "SELECT cust_id from Withdraw group by(cust_id) having count(*)>=all (select count(w_id) from Withdraw group by cust_id)"
    cursor.execute(sql)
    result = cursor.fetchall()
    for r in result:
        print (r)
    cursor.close();
    connection.close();

In [7]:
largetime_cust()

(102,)